Revit 2027 API
ExternalDataManagerDataItemId(ExternalDataManagerDataItemId) Constructor
 Create a copy of the object.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDataManagerDataItemId(
	ExternalDataManagerDataItemId other
)
Public Sub New (
	other As ExternalDataManagerDataItemId
)
public:
ExternalDataManagerDataItemId(
	ExternalDataManagerDataItemId^ other
)
new :
        other : ExternalDataManagerDataItemId -> ExternalDataManagerDataItemId
Parameters
other ExternalDataManagerDataItemId
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalDataManagerDataItemId Class
ExternalDataManagerDataItemId Overload
Autodesk.Revit.UI Namespace